[
	{
		"name":"g1",
		"definition":"<G1> All Teams are expected to conduct themselves in a respectful and professional manner while competing in VEX Robotics Competition events. If a Team or any of its members (Students or any adults associated with the Team) are disrespectful or uncivil to event staff, volunteers, or fellow competitors, they may be Disqualified from a current or upcoming Match, or even the entirety of the event depending on the severity of the situation. It is important to remember that we are all judged based on how we deal with adversity. It is important that we all exhibit maturity and class when dealing with any difficult situations that may present themselves in both the VEX Robotics Competition and our lives in general."
	},
	{
		"name": "g2",
		"definition": "<G2> When reading and applying the various rules in this document, please remember that common sense always applies in the VEX Robotics Competition."
	},
	{
		"name": "g3",
		"definition": "<G3> At the beginning of a Match, each Robot must be smaller than a volume of 18” (457.2 mm) long by 18” (457.2 mm) wide by 18” (457.2 mm) tall. An offending Robot will be removed from the match at the Head Referee’s discretion."
	},
	{
		"name": "g4",
		"definition": "<G4> Each Team shall include up to three Drive Team Members. No Drive Team Member may fulfill this role for more than one Team at any given event."
	},
	{
		"name": "g5",
		"definition": "<G5> Drive Team Members may only touch the Team’s controls, Robot, and Scoring Objects at specified times during a Match as per <G5a> and <SG3>. Drive Team Members are prohibited from making intentional contact with any Scoring Object, Field Element or Robot during a Match, with the exception of the contact specified in <G5a> and <SG3>.\n\ta. During the Driver Controlled Period, Drive Team Members may handle their own Robot if no part of the robot has moved at all during the Match. The type of fixes that are allowed are limited to the following:\n\t\ta. Turning the Robot on or off\n\t\tb. Plugging in a battery and/or power expander \n\t\tc. Plugging in a VEXnet Key\n\t\td. Turning the power expander on or off\n\tb. Drive Team Members are not permitted to break the plane of field perimeter at anytime during the match, with the exception of the actions described in <G5a> and <SG3>.\nMinor violations of these rules that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "g6",
		"definition": "<G6> During a Match, the Drive Team Members must remain in their Alliance Station. Drive Team Members are not allowed to use any sort of communication devices during their Match. Devices with communication features turned off (e.g. a phone in airplane mode) are allowed."
	},
	{
		"name": "g7",
		"definition": "<G7> During the qualification rounds, the red Alliance has the right to place its Robots on the field last. During the elimination rounds, the higher seeded Alliance has the right to place its Robots on the field last. Once a Team has placed its Robot on the field, its position cannot be readjusted prior to the Match. A Team that violates this rule will have its robots randomly repositioned by the referees.\n\ta. Robots must be placed on the field promptly. Repeated failure to do so could result in a violation of <G1>"
	},
	{
		"name": "g8",
		"definition": "<G8> During a Match, Robots may be operated only by the Drive Team Members and/or by software running on the Robot’s control system. During the Autonomous Period Drive Team Members are not permitted to interact with the Robot, the controls on their VEXnet Joysticks, or to unplug from the field in any way, directly or indirectly. (e.g. Triggering sensors without touching the Robot is still illegal.) Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "g9",
		"definition": "<G9> Scores will be calculated for all Matches immediately after the Match once all objects and Robots on the field come to rest. The determination of the Autonomous Bonus will occur for all Matches immediately after the Autonomous Period after all objects and Robots on the field come to rest."
	},
	{
		"name": "g10",
		"definition": "<G10> Any infractions committed during the Autonomous Period that are not Match Affecting, but do affect the outcome of the Autonomous Bonus, will result in the Autonomous Bonus being automatically awarded to the opposing Alliance."
	},
	{
		"name": "g11",
		"definition": "<G11> Robots may not intentionally detach parts during any Match, or leave mechanisms on the field. Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. Multiple intentional infractions may result in Disqualification for the entire competition."
	},
	{
		"name": "g12",
		"definition": "<G12> Strategies aimed solely at the destruction, damage, tipping over, or Entanglement of Robots are not part of the ethos of the VEX Robotics Competition and are not allowed. However, VEX Robotics Competition In the Zone is an interactive game. Some incidental tipping, Entanglement, and damage may occur as a part of normal game play. If the tipping, Entanglement, or damage is ruled to be intentional or egregious, the offending Team may be disqualified from that Match. Repeated offenses could result in a Team being Disqualified from the remainder of the competition.\nVEX Robotics Competition In the Zone is intended to be an offensive game. Teams that partake in solely defensive strategies will undergo extra scrutiny in regard to <G12>. In the case where referees are forced to make a judgment call on interaction between a defensive and offensive Robot, the referees will err on the side of the offensive Robot.\nA Team is responsible for the actions of its Robot at all times, including the Autonomous Period. This goes for Teams that are driving recklessly and potentially causing damage, but also goes for Teams that drive around with a small wheel base. A Team should design its Robot such that it is not easily tipped over or damaged by minor contact."
	},
	{
		"name": "g13",
		"definition": "<G13>Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "g14",
		"definition": "<G14> Robots must be designed to permit easy removal of Scoring Objects from any mechanism without requiring the Robot to have power after a Match."
	},
	{
		"name": "g15",
		"definition": "<G15> Field tolerances may vary by as much as ±1”, except where otherwise noted, so Teams must design Robots accordingly. Please make sure to check Appendix A for more specific tolerances. Note: The field perimeter should always be resting upon the Field Perimeter Rubber Feet, regardless of whether or not the tabs have been cut off the foam field tiles."
	},
	{
		"name": "g16",
		"definition": "<G16> Replays are at the discretion of the Event Partner and Head Referee, and will only be issued in the most extreme circumstances."
	},
	{
		"name": "g17",
		"definition": "<G17> All Teams must adhere to all VEX Robotics Competition Rules as they are written and must abide by the stated intent of the rules. Every Team has the opportunity to ask for official rules interpretationsintheVEXRoboticsCompetitionQuestion&AnswerForum. Allresponsesinthis Q&A forum should be treated as official rulings from the VEX Robotics Competition Game Design Committee, and they represent the correct and official interpretation of the VEX Robotics Competition Rules.\nThere may also be periodic “Team Updates” posted on the VEX Robotics Competition In the Zone webpage in the competition section of www.vexrobotics.com and www.roboticseducation.org. These updates are also “official” parts of the VEX Robotics Competition In the Zone rules.\nThe VEX Robotics Competition Question & Answer Forum can be found at www.vexforum.com, or directly at http://www.vexrobotics.com/In_the_Zone."
	},
	{
		"name": "g18",
		"definition": "<G18> All rules in this manual are subject to changes, and not considered official until August 17th, 2017. We do not expect any major changes to take place, however we do reserve the right to make game changes until August 17th, 2017. There will also be scheduled manual updates on June 15th, 2017 and April 5th, 2018.\n\ta. The Game Design Committee reserves the right to make changes to this manual in the April 5th, 2018 release specifically for the VEX Robotics World Championship. Specific items which will be considered for changes are the number of Cones and Mobile Goals."
	}
]