<R1> Only one (1) robot will be allowed to compete per team in the VEX Robotics Competition. Though it is expected that teams will make changes to their robot at the competition, a team is limited to only one (1) robot. As such, a VEX robot, for the purposes of the VEX Robotics Competition, has the following subsystems:\nSubsystem 1: Mobile robotic base including wheels, tracks, legs, or any other mechanism that allows the robot to navigate the majority of the flat playing field surface. For a stationary robot, the robotic base without wheels would be considered Subsystem 1.\nSubsystem 2: Power and control system that includes a VEX legal battery, a VEX control system, and associated motors for the mobile robotic base.\nSubsystem 3: Additional mechanisms (and associated motors) that allow manipulation of game objects or navigation of field obstacles.\nGiven the above definitions, a minimum robot for use in any VEX Robotics Competition event (including skills challenges) must consist of 1 and 2 above. Thus if you are swapping out an entire subsystem of either item 1 or 2, you have now created a second robot and are no longer legal.\n\ta. Teams may not compete with one robot, while a second is being modified or assembled. b. Teams may not switch back and forth between multiple robots during a competition.
 
<R2> Every robot will be required to pass a full inspection before being cleared to compete. This inspection will ensure that all robot rules and regulations are met. Initial inspections will take place during team registration/practice time.\n\ta. If significant changes are made to a robot, it must be re-inspected before it will be allowed to compete.\n\tb. All robot configurations must be inspected before being used in competition.\n\tc. Teams may be requested to submit to random spot-inspections by event personnel. Refusal to submit will result in disqualification.\n\td. Referees or inspectors may decide that a robot is in violation of the rules. In this event, the team in violation will be disqualified and the robot will be barred from the playing field until it passes re-inspection.

<R3> The following types of mechanisms and components are NOT allowed:\n\ta. Those that could potentially damage playing field components.\n\tb. Those that could potentially damage other competing robots.\n\tc. Those that pose an unnecessary risk of entanglement.

<R4> At the beginning of any match, robots must be smaller than 18” x 18” x 18”.\n\ta. During inspections, robots will be measured in one of two ways\n\t\ti. Robots will be placed into a “sizing box” which has interior dimensions matching the above size constraints. To pass inspection, a robot must fit within the box without touching the box walls or ceiling.\n\t\tii. Robots will be sized using a VEX Robotics Competition Robot Sizing Tool. Robots will be placed on a flat surface and must not touch the measurement slide as it is passed over the surface. Please see http://www.vexrobotics.com/vex/products/competition- products/vrc-products/276-2086.html for a visual reference.\n\tb. Robots may expand beyond their starting size constraints after the start of a match.\n\tc. Any restraints used to maintain starting size (i.e. zip ties, rubber bands, etc.) MUST remain attached to the robot for the duration of the match.

<R5> Robots may be built ONLY from Official Robot Components from the VEX Robotics Design System unless otherwise specifically noted within these rules.\n\ta. During inspections if there is a question about whether something is an official VEX component, a team will be required to provide documentation to an inspector, which proves the component’s source. Such types of documentation include receipts, part numbers, or other printed documentation.\n\tb. OnlytheVEXRoboticsDesignSystemComponentsspecificallydesignedtobeusedfor Robot construction are allowed. Using additional components outside their typical purpose is against the intent of the rule (i.e. please don’t try using VEX apparel, competition support materials, packaging or other non-robot products on a VEX Robotics Competition Robot).\n\tc. Products from the VEXpro, VEX IQ, or VEX Robotics by HEXBUG product line cannot be used for robot construction, unless specifically allowed by a clause of <R7>. Products from the VEXpro or VEX IQ, or VEX Robotics by HEXBUG product line which are also cross listed as part of the VEX product line are legal.\n\td. OfficialRoboticsComponentsfromtheVEXRoboticsDesignSystemwhichhavebeen discontinued are still legal for competition use. However teams must be cognizant of <R5a>.

<R6> Official VEX products are ONLY available from VEX & Official VEX Resellers. To determine whether a product is “official” or not, consult www.vexrobotics.com.

<R7> Robots are allowed the following additional “non-VEX” components:\n\ta. Any material strictly used as a color filter or a color marker for a VEX Light Sensor.\n\tb. Any parts which are identical to legal VEX parts. For the purposes of this rule, productswhich are identical in all ways except for color are permissible. Note: It is up to inspectors to determine whether a component is “identical” to an official VEX component.\n\tc. Any commercially available #4, #6, #8, M2, M2.5, M3 or M4 screw up to 2" long, and any commercially available nut and/or washer to fit these screws.\n\td. Teams may add non-functional decorations provided that these do not affect the robot performance in any significant way or affect the outcome of the match. These decorations must be in the spirit of the competition. Inspectors will have final say in what is considered “nonfunctional”.\n\t\ti. Anodizing and painting of parts would be considered a legal nonfunctional decoration\n\t\tii. Any guards or decals must be backed by legal materials that provide the same functionality. i.e. If your robot has a giant decal that prevents Scoring Objects from falling out of the robot, the decal must be backed by VEX material that also prevents the Scoring Objects from falling out.\n\t\tiii. If using the VEX speaker (Part #276-1504), the chosen audio must not be distracting and must be in good taste. The Head Inspector and Head Referee will make the final decision on the appropriateness of the audio.\n\t\tiv. Cameras are permitted as non-functional decorations provided that any transmitting functions or wireless communications are disabled. Unusually large cameras being used as ballast are not permitted.\n\te. Any non-aerosol based greaseor lubricating compound, when used in extreme moderation on surfaces and locations that do NOT come into contact with the playing field walls, foam field surface, game objects, or other robots.\n\tf. Non shattering plastic from the following list; polycarbonate, acetel monopolymer (Delrin), acetal copolymer (Acetron GP), POM (acetal), ABS, PEEK, PET, HDPE, LDPE, Nylon (all grades), Polypropylene, FEP; as cut from a single 12" x 24" sheet up to 0.070" thick.\n\t\ti. Plastic can be mechanically altered by cutting, drilling or bending etc., but it cannot be chemically treated, melted or cast. Teams may heat the polycarbonate to aid in bending.\n\tg. A small amount of tape may be used for the following purposes:\n\t\ti. For the sole purpose of securing any connection between the ends of two (2) VEX cables.\n\t\tii. For labeling wires and motors.\n\t\tiii. Teflon tape solely for the purposes of preventing leaks may be used on the threaded portions of pneumatic fittings.\n\t\tiv. For securing and retaining a VEXnet key to the VEX ARM® Cortex®-based Microcontroller. Using tape in this manner is highly recommended to ensure a robust connection.\n\th. Hot glue for securing cable connections\n\tj. A USB extension cable may be used for the sole purpose of remote mounting of a VEXnet key. The key must be mounted in the following manner.\n\t\ti. The VEXnet key must be mounted such that no metal is touching the key above the VEXnet logo.\n\t\tii. We highly recommend that no metal may be within 2” of the top of the VEXnet key.\n\tk. Anunlimitedamountof1/8”,braided,nylonrope \n\tl. Commercially available items used solely for the purpose of bundling or wrapping of 2-wire, 3-wire, 4-wire cables, and pneumatic tubing, for the purposes of protection, organization, or management are allowed. This includes but is not limited to electrical tape, cable carrier, cable track, etc. Note: it is up to inspectors to determine whether a component is serving a function beyond protecting and managing cables.\n\tm. VEX IQ pins used solely for the purpose of attaching VEX Team Identification Number Plates.

<R8> Additional VEX Robotics Design System Components that are released during the competition season are considered legal for use.\nSome “new” components may have certain restrictions placed on them upon their release. These restrictions will be documented in a Team Update. Team Updates will be posted to the VRC In the Zone home page in the Competition section of www.vexobotics.com
 
<R9> Robots must use ONLY one (1) VEX EDR Microcontroller.\n\ta. Examples of VEX EDR Microcontrollers are the VEX v.5 PIC Microcontroller and the VEX ARM® Cortex®-based Microcontroller.\n\tb. Microcontrollers that are part of other VEX product lines such as VEXpro, VEXRCR, VEXIQ, or VEX Robotics by HEXBUG are not allowed.

<R10> Robots must ONLY utilize the VEXnet system for all robot communication.\n\ta. VEX 75Mhz Crystal Radios are prohibited. (Some events may allow the use of 75Mhz Crystal Radios, please see the Special Event Rule Modifications later in this section.)\n\tb. Electronics from the VEXpro, VEX-RCR, VEXIQ, or VEX Robotics by HEXBUG product line are prohibited including all VEXplorer electronics.\n\tc. A VEXnet Joystick may only be used in conjunction with a VEX ARM® Cortex®-based Microcontroller. A VEXnet upgraded 75MHz Transmitter may only be used in conjunction with a PIC Microcontroller. Mixing and matching VEXnet transmitters and receivers is prohibited.

<R11> Robots may use either:\nOption 1: Up to ten (10) VEX EDR motors or VEX Servos (Any combination, up to ten) and a legal VRC pneumatic system. (See <R18>)\nOption 2: Up to twelve (12) VEX EDR motors or VEX Servos (Any combination, up to twelve) and no pneumatic components, excluding pneumatic tubing.\n\ta. 2-Wire Motors must be controlled by a 2-Wire Motor Port, either directly on a VEX Microcontroller (P/N 276-2194), or on a "VEX Motor Controller 29" module.\n\tb. Teams may NOT use multiple 2-wire MotorPorts, 3-wire PWM Motor Ports, or Motor Controller 29 modules on a single motor.

<R12> A maximum of one (1) VEX Y-cable can be used per Motor Port of the Microcontroller or Power Expander. (You cannot “Y off a Y” to have more than two (2) motors controlled by the same Motor Port.)\n\ta. Teams using the VEX ARM® Cortex®-based Microcontroller can only power one (1) 2-wire Motor per each of the two 2-wire motor ports on the Microcontroller. It is illegal to "Y" off a 2-wire Motor Port.\n\tb. Teams may not “Y” off a Motor Controller 29

<R13> The only allowable sources of electrical power for a VEX Robotics Competition Robot is any single (1) VEX 7.2V Robot Battery Pack of any type, unless the robot is utilizing the VEX Power Expander, and a single (1) 9V backup battery. Robots utilizing the VEX Power Expander can use a second (2) VEX 7.2V Robot Battery of any type.\n\ta. Additional batteries cannot be used on the robot (even ones that aren’t connected).\n\tb. Robots are permitted to use a maximum of one (1) VEX Power Expander.\n\tc. To ensure reliable wireless communication, it is required that all teams connect a charged 9V Backup battery to their VEXnet system using the VEXnet Backup Battery Holder (276-2243).\n\td. Any VEX 7.2V Battery Pack is legal, in the quantities described above.\n\te. The only legal means for charging a VEX 7.2V Battery Pack is via one of the following VEX Battery Chargers: Smart Charger, 276-1445; Smart Charger v2, 276-2519; 276-2221 (discontinued), 276-2235 (discontinued). All other chargers are strictly prohibited.\n\tf. VEXnet Joysticks must only be powered by AAA batteries.\n\ti. Some events may provide field power for VEXnet Joysticks. If this is provided for all teams at the event, this is a legal source of power for VEXnet Joysticks.

<R14> No more than two VEX hand-held transmitters may control a single robot during the tournament. No modification of these transmitters is allowed of ANY kind.
\n\ta. No other methods of controlling the robot (light, sound, etc) are permissible. 

<R15> Parts may NOT be modified as follows:\n\ta. Motors (including the internal PTC), extension cords, sensors, controllers, battery packs, reservoirs, solenoids, pistons and any other electrical component or pneumatics component of the VEX Robotics Design System may NOT be altered from their original state in ANY way.\n\t\ti. Internal or external mechanical repairs of VEX Limit and Bumper switches are permitted; using components from these devices in other applications is prohibited\n\t\tii. External wires on VEX electrical components may be repaired by soldering, using twist/crimp connectors, electrical tape or shrink tubing such that the original functionality / length is not modified in any way. Wire used in repairs must be identical to VEX wire. Teams may make these repairs at their own risk; incorrect wiring may have undesired results.\n\t\tiii. Teams may change or replace the gears in the “2-Wire 393” or “2-Wire 269” motors, with the corresponding official VEX Replacement Gears\n\t\tiv. Teams may cut pneumatic tubing to a desired length\n\tb. Welding, soldering, brazing, gluing, or attaching in any way that is not provided with in the VEX Robotics Design System will NOT be allowed.\n\t\ti. Mechanical fasteners may be secured using Loctite or a similar thread-locking product; this may be used for securing hardware ONLY.\n\t\tii. Teams are permitted to fuse/melt the end of the 1/8” nylon rope to prevent fraying\n\t\tiii. The gluing permitted by <R7h> is an exception to this rule.

<R16> The Robot on/off switch must be accessible without moving or lifting the robot. The Robot Microcontroller lights should also be visible by competition personnel to assist in diagnosing robot problems.

<R17> Teams must bring their robots to the field prepared to play. Teams who use VEX pneumatics must have their systems charged before they place the robot on the field.

<R18> Pneumatic devices may only be charged to a maximum of 100 psi. Teams may only use a maximum of two (2) legal VEX pneumatic air reservoirs on a Robot.\nThe intent of this rule is to limit teams to the air pressure stored in two reservoir tanks, as well as the normal working air pressure contained in their pneumatic cylinders and tubing on the robot. Teams may not use other elements (e.g. surgical tubing) for the purposes of storing air pressure. Teams who use cylinders and additional pneumatic tubing for no purpose other than additional storage are in violation of the spirit of this rule and will fail inspection.

<R19> To participate in an official VEX Robotics Competition Tournament a team must first register on robotevents.com. Upon registering they will receive their VEX Team Identification Number (VEX Team ID#) and a welcome kit containing VEX Team Identification Number Plates. Every robot should have their VEX Team ID# Plates displayed on a minimum of 2-opposing sides.\n\ta. The VEX Team Identification Number Plates are considered a non-functional decoration, and cannot be used as a functional part of the robot.\n\tb. These number plates must fulfill all robot rules (i.e. they must fit within the 18” cube per <R4>, they cannot cause entanglement, etc.)\n\tc. Robots must use the colored plates that match their alliance color for each match. (i.e. Robots on the red alliance must have their red plates on for the match) It must be abundantly clear which color alliance the robot belongs to.

<R20> During the Autonomous Period, human operators will not be allowed to use their hand-held controllers. As such, teams are responsible for programming their robot with custom software if they want to perform in Autonomous mode.\nFor more information on this, teams should consult the help guides produced by the developers of their chosen programming software.

<R21> Any violation of robot rules will result in a team being unable to play until they pass inspection (per <R2d>). In addition, teams who intentionally circumvent or violate rules to gain an advantage over their fellow competitors are in violation of the spirit and ethos of the competition. As such, anyone caught violating a rule in this manner may be disqualified from upcoming matches, the event, or even future events at the discretion of the VEX Robotics Competition Game Design Committee.