[
	{
		"name": "sg1",
		"definition": "<SG1> At the beginning of each Match, each Robot must be placed such that it is touching the Alliance’s Starting Bar, not touching any Scoring Object other than those permitted by <!SG2> and not touching another Robot."
	},
	{
		"name": "sg2",
		"definition": "<SG2> Prior to the start of each Match, each Robot must use its one (1) Cone available as a Preload. A Cone is considered to be legally preloaded if it is touching the Robot, not touching another Robot, and is fully within the field perimeter. If a Robot is not present for their Match, their Cone will be placed randomly such that it is touching the Alliance Starting Bar."
	},
	{
		"name": "sg3",
		"definition": "<SG3> There can never be more than one (1) Cone on a Loader at any given time. There will be one (1) Cone on the Loader to start the Match. Additional Cones may be loaded by a Drive Team Member onto the Loader at any point during the Match. Cones must be placed upright and upon the Loader. Robots may not contact a Cone if it is being touched by a human.\nNote: Cones are considered to be “in play” once they are placed on the Loader and may no longer be contacted by Drive Team Members.\n\ta. Robots may not contact Cones on the opposing Alliance Loader.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion"
	},
	{
		"name": "sg4",
		"definition": "<SG4> A Robot may not Pin or Trap an opposing Robot for more than five seconds during the Driver Controlled Period. A Pin or Trap is officially over once the Pinning Robot has moved away and the Robots are separated by at least 2 feet (approximately one (1) foam tile). After ending a Pin or Trap, a Robot may not Pin or Trap the same Robot again for a duration of 5 seconds; if a Team does pin the same Robot again, the pinning count will resume from where it left off when the pinning Robot initially backed off.\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. There is no penalty for Pinning during the Autonomous Period."
	},
	{
		"name": "sg5",
		"definition": "<SG5> Robots may not intentionally or accidentally, indirectly or directly, remove Cones from an opponent’s Stack (i.e. Cones that are fully nested on an opponent's upright Goal).\n\ta. A Robot that accidentally knocks over an opponent’s Goal, causing Cones to be removed, would be in violation of this rule. Teams should exercise extreme caution when interacting with or around opponent Goals.\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg6",
		"definition": "<SG6> Robots may not intentionally grasp, grapple or attach to any Field Elements or the opposing Mobile Goals. Strategies with mechanisms that react against multiple sides of a Field Element in an effort to latch onto said Field Element are prohibited. The intent of this rule is to prevent Teams from both unintentionally damaging the field and/or from anchoring themselves to the field. Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg7",
		"definition": "<SG7> Two Robots on the same Alliance may not work in tandem to block access to portions of the field. Examples include, but are not limited to, two Robots blocking access to:\n\t• Scoring Zones\n\t• Corners of the field (especially in an effort remove access to Cones or Mobile Goals)\n\t• The Loader\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.\nNote: Robots incidentally blocking access to portions of the field while attempting to Stack Cones on Goals, Score Mobile Goals in Goal Zones or while Parking is an expected part of game play."
	},
	{
		"name": "sg8",
		"definition": "<SG8> It is expected that Scoring Objects may unintentionally leave the field during Match play. Scoring Objects that leave the playing field will not be returned. Teams may not intentionally remove Scoring Objects from the field while not in the process of Scoring/Stacking. We do expect Scoring Objects to leave the field accidently during intentional Scoring/Stacking, however doing so intentionally or repeatedly would be a violation of this rule.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg9",
		"definition": "<SG9> Robots may not Possess more than one (1) Cone at a time.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.\nNote: The intent of this rule is not to punish Robots for pushing Cones that are in their way; that is, Robots are free to incidentally drive through Cones on the field while Possessing a Cone. However, Teams are not allowed to employ Cone hoarding strategies. Cone “hoarding” refers to the act of intentionally plowing multiple Cones to a specific location of the field, even with a flat/convex portion of a Robot, such that they are kept away from the opposing Alliance.\nNote 2: Stacked Cones do not count towards the Possession limit. (i.e. A Robot is allowed to control the movement of a Mobile Goal with Stacked Cones). Robots can interact with Cones that are fully nested on upright Goals without those Cones counting towards the possession limit, provided that those Cones would otherwise be considered Stacked if they were not being contacted by a Robot."
	},
	{
		"name": "sg10",
		"definition": "<SG10> Robots may not contact the opposing Alliance’s 10 Point Zone or 20 Point Zone.\n\ta. Robots may not contact an opposing Robot that is contacting opposing Robot’s 10 Point Zone, 20 Point Zone, or Starting Bar.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg11",
		"definition": "<SG11> Robots may not put a Mobile Goal in an opposite Goal Zone. (i.e. A Robot, regardless of Alliance, cannot put a red Mobile Goal in a blue Goal Zone or a blue Mobile Goal in a red Goal Zone.)\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg12",
		"definition": "<SG12> Robots may not intentionally drop or place Scoring Objects on an opponent Robot.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion."
	},
	{
		"name": "sg13",
		"definition": "<SG13> At the start of the Match all Scoring Objects on the field will be placed upright in their designated locations, however the rotation is not specified."
	},
	{
		"name": "sg14",
		"definition": "<SG14> As per <G3>, at the beginning of a Match, each Robot must be smaller than a volume of 18” (457.2 mm) long by 18” (457.2 mm) wide by 18” (457.2 mm) tall. Once the Match begins, Robots may expand, but no horizontal dimension can exceed 36” (914.4 mm) at any point during the Match.\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.\n\ta. There is no height limit on Robot expansion."
	},
	{
		"name": "sg15",
		"definition": "<SG15> Scoring Objects cannot be used to accomplish actions that would be otherwise illegal if they were attempted by Robot mechanisms."
	}
]